web/app/controllers/export_controller.rb

  def show
    @product = Product.last
---
SELECT  `products`.* FROM `products` ORDER BY `products`.`id` DESC LIMIT 1

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO `products` (`created_at`, `updated_at`, `pdf`) VALUES ('2019-03-03 10:50:23', '2019-03-03 10:50:23', 'report.pdf')